package com.jyk.stack;

public class KoreanTest {
	public static void main(String[] args) {
		String s = "욺저ㅣㅏ넘ㅋㅍ.ㅌ123:;ㅋㄴㅊ,프awem	 	f3fjd프ㅏㅣㅁ즏ㄼㄹ 	dfsm ㅓㅈㄷㄹ   	 9ㅁ0저,r름ㅇ자러3ㅈ     ㄹwaef m:";

		System.out.println(s.replaceAll("[ㄱ-ㅎㅏ-ㅣ가-힣]", ""));

	}

}



//┌────────────────────────────────────────────────────────────────┐
//
//O r d e r              
//───────────────────────────────────────────────────────────────  
//│ 1. 더블 에스프레소 칩 프라푸치노 │ 6300
//│ 사이즈 벤티 │ 사이즈가격 1000 │ 컵 매장컵 │ 수량12
//│ 샷      5 │ 샷가격1800 │ 
//│ 디카페인 │ 300 │ 
//│ 바닐라 시럽3 │ 600 │ 
//│ 헤이즐넛 시럽4 │ 600 │ 
//│ 카라멜 시럽5 │ 600 │ 
//│ null │ 0 │ 
//│ 초콜릿드리즐 많이 │ 600 │ 
//----------------------------------------------------
//│ 2. 더블 에스프레소 칩 프라푸치노 │ 6300
//│ 사이즈 숏 │ 사이즈가격 -500 │ 컵 개인컵 │ 수량2
//│ 샷      0 │ 샷가격0 │ 
//│ null │ 0 │ 
//│ 바닐라 시럽0 │ 0 │ 
//│ 헤이즐넛 시럽0 │ 0 │ 
//│ 카라멜 시럽0 │ 0 │ 
//│ 에스프레소휘핑 보통 │ 600 │ 
//│ null │ 0 │ 
//----------------------------------------------------
//┌─────────────────┐
//│ c.주문하러 가기 │
//└─────────────────┘
//            x.비우기  z.뒤로  m.메인 
//└────────────────────────────────────────────────────────────────┘
